# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 6 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone with adjustments for BackboneWithAttention
backbone:
  backbone:
  [
    [-1, 1, BackboneWithAttention, [3, 128]],  # RGB input
    [-1, 1, Conv, [128, 3, 2]],  # Downsampling
    [-1, 3, C3, [128]],  # CSP bottleneck
    [-1, 1, BackboneWithAttention, [128, 256]],  # Add spatial attention
    [-1, 6, C3, [256]],  # CSP bottleneck
    [-1, 1, BackboneWithAttention, [256, 512]],  # Add spatial attention
    [-1, 1, Conv, [512, 3, 2]],  # Downsampling
    [-1, 3, C3, [512]],  # CSP bottleneck
    [-1, 1, AtrousSPPF, [512, 1024]],  # Atrous Spatial Pyramid Pooling
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],  # Layer 9
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # Layer 10
    [[-1, 5], 1, Concat, [1]],  # Layer 11 (references backbone layer 5)
    [-1, 3, C3, [512, False]],  # Layer 12

    [-1, 1, Conv, [256, 1, 1]],  # Layer 13
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # Layer 14
    [[-1, 3], 1, Concat, [1]],  # Layer 15 (references backbone layer 3)
    [-1, 3, C3, [256, False]],  # Layer 16 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],  # Layer 17
    [[-1, 7], 1, Concat, [1]],  # Layer 18 (references backbone layer 7)
    [-1, 3, C3, [512, False]],  # Layer 19 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],  # Layer 20
    [[-1, 8], 1, Concat, [1]],  # Layer 21 (references backbone layer 8)
    [-1, 3, C3, [1024, False]],  # Layer 22 (P5/32-large)

    [[16, 19, 22], 1, Detect, [nc, anchors]],  # Corrected Detect
  ]